{"id":668,"date":"2023-11-19T09:56:51","date_gmt":"2023-11-19T09:56:51","guid":{"rendered":"https:\/\/newerawebsites.com\/?p=668"},"modified":"2024-08-04T03:53:56","modified_gmt":"2024-08-04T03:53:56","slug":"road-to-new-era-3","status":"publish","type":"post","link":"https:\/\/newerawebsites.com\/road-to-new-era-3\/","title":{"rendered":"ROAD TO NEW ERA 3"},"content":{"rendered":"\n<p>Digital New Era: A Closer Look<\/p>\n\n\n\n<p>Let's revisit Digital New Era and delve deeper into its branding and overall vision.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Branding and Design Philosophy<\/h3>\n\n\n\n<p>As a fan of the retro vibe, I'm deeply nostalgic. This sentiment permeates the website and entire brand, creating a unique aesthetic that stands out. Interestingly, one of the key trends in digital design for 2023 includes elements such as pixels, bright colors, retro aesthetics, squares, and dots. However, it's worth noting that I conceived this idea before these trends were announced, which suggests that I might just be ahead of the curve in dictating the fashion of graphic and web design globally!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Thinking Outside the Box<\/h3>\n\n\n\n<p>I aim to infuse a genuine \"thinking outside the box\" mentality into every aspect of the brand. I'm aware that this approach might draw criticism from UX gurus who prioritize tests, persona interviews, and optimal user flows. My focus, however, is on creating a \"wow\" effect that captivates users and ensures they enjoy navigating the site. If a user is intrigued enough, they will figure out how to use it effectively.<\/p>\n\n\n\n<p>Admittedly, this branding style targets a niche audience, but I have no desire to cater to everyone, especially not Aunt Ginchi. We are okay with that.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Mentoring Program Insights<\/h3>\n\n\n\n<p>Now, let's get back to the excellent mentoring program, Mentor the Young, and my outstanding mentor, Todor Madjarov.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Third Chat with Todor Madjarov<\/h3>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Periodic Updates<\/strong>: Due to our busy schedules, there were intervals of 7-10 days without communication. Each meeting began with updates on my progress during those periods. Often, the meeting wasn't enough to cover both updates and new issues.<\/li>\n\n\n\n<li><strong>Summary and Prioritization of Goals<\/strong>:\n<ul class=\"wp-block-list\">\n<li>Avoid wasting time on low-priority tasks.<\/li>\n\n\n\n<li>Since we don't rely on organic traffic or ads, we need to prepare for various direct customer contact and selling techniques.<\/li>\n\n\n\n<li>Develop a business plan suitable for attracting investors (a topic deserving of its own post).<\/li>\n\n\n\n<li>The primary goal was to secure at least one sale by the end of the three-month period. Although this goal wasn't met in the program's context, I did have a few freelance projects that fulfilled this objective.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Business Scenarios<\/strong>: We discussed various scenarios, including identifying potential buyers, clearly describing the services offered, and justifying the value of those services. This is still a work in progress.<\/li>\n\n\n\n<li><strong>Interesting Case Study<\/strong>: Initially, the idea was to create a SaaS product where customers would pay a monthly subscription for a web solution. This model works well for corporations with substantial resources, systems, and employees. For a smaller operation like mine, it’s more practical to sell a website for a lump sum (e.g., 700,000 BGN excluding VAT) and then offer maintenance as a subscription service.<\/li>\n<\/ol>\n\n\n\n<h3 class=\"wp-block-heading\">Hosting and Maintenance<\/h3>\n\n\n\n<p>Why don't I offer hosting?<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Additional Work<\/strong>: It would add to my already significant workload.<\/li>\n\n\n\n<li><strong>Additional Responsibilities<\/strong>: Managing databases, information security, client security, etc.<\/li>\n\n\n\n<li><strong>Low Profit<\/strong>: Using a third-party hosting provider results in minimal profit margins.<\/li>\n<\/ul>\n\n\n\n<p>Instead, I charge a maintenance fee for additional designs, changes, content updates, new pages, and more. This approach provides a steady revenue stream without the complications of hosting.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion<\/h3>\n\n\n\n<p>Digital New Era is not just another digital agency; it’s a bold experiment in innovative design and practical business solutions. Stay tuned for more updates, and feel free to share your thoughts and suggestions. Good luck! there.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digital New Era: A Closer Look Let's revisit Digital New Era and delve deeper into its branding and overall vision. Branding and Design Philosophy As a fan of the retro vibe, I'm deeply nostalgic. This sentiment permeates the website and entire brand, creating a unique aesthetic that stands out. Interestingly, one of the key trends [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":683,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[3],"tags":[],"class_list":["post-668","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog-article"],"acf":[],"_links":{"self":[{"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/posts\/668"}],"collection":[{"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/comments?post=668"}],"version-history":[{"count":0,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/posts\/668\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/media\/683"}],"wp:attachment":[{"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/media?parent=668"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/categories?post=668"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/newerawebsites.com\/wp-json\/wp\/v2\/tags?post=668"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}